[
  {
    "id": "63741",
    "title": "Jelly Dash 3d",
    "description": "Enter a casual arcade running game in Jelly Dash 3D. In this fun game, you control a cute little jelly. Run across colorful tracks. Overcome obstacles and collect exciting rewards. Guide your jelly character as it races down a 3D track. Surpass the target number of people in each stage time and you will move on.",
    "instructions": "Mouse click or tap to play ",
    "url": "https://html5.gamemonetize.com/64sbpx61sag3up4r4j5u488b5u7ngrt7/",
    "category": "Racing",
    "tags": "Cute, Jelly, run",
    "thumb": "https://img.gamemonetize.com/64sbpx61sag3up4r4j5u488b5u7ngrt7/512x384.jpg",
    "width": "1280",
    "height": "720"
  },
  {
    "id": "63738",
    "title": "Mob Handler",
    "description": "Enter the wonderful arcade game in the Mob Handler. As a mob handler, face many waves of enemies. Beat the incoming mob by shooting. Use your math skills to calculate the maximum value and go through the gates that boost your skills. You will test your reflexes, strategic planning, and quick thinking. Shooting Ammo, Atk, etc.",
    "instructions": "Mouse click or tap to play ",
    "url": "https://html5.gamemonetize.com/5ss80eil56o308ihm507lycgshesuy6q/",
    "category": "Arcade",
    "tags": "Enemies, Shoot, Skills",
    "thumb": "https://img.gamemonetize.com/5ss80eil56o308ihm507lycgshesuy6q/512x384.jpg",
    "width": "750",
    "height": "1334"
  },
  {
    "id": "63969",
    "title": "Territory.io",
    "description": "Territory.io is an exciting territory capture game where players compete to control the largest area of the map. Features: &bull; Capture territory by creating loops with your trail &bull; Compete against AI opponents for dominance &bull; Collect power-ups for special abilities &bull; Simple controls: use WASD or arrow keys to move &bull; Real-time leaderboard shows whos winning &bull; Fast-paced gameplay with strategic elements Can you become the territory master? Play now and claim your space!",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/z1tr0vb7m6qx9thl63e91rxy07u1mklx/",
    "category": "Arcade",
    "tags": ".io, .io Games, Arcade, Battle, Casual, Snake, Strategy, survival",
    "thumb": "https://img.gamemonetize.com/z1tr0vb7m6qx9thl63e91rxy07u1mklx/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "63998",
    "title": "One Piece Anime Girls",
    "description": "Rotating tile puzzle featuring anime girls from the One Piece universe. Players must rotate tiles to piece together images of the beloved characters, 5 Levels of Anime Girls.",
    "instructions": "Mouse Touch",
    "url": "https://html5.gamemonetize.com/16jzabb18zdx9s9otw9fikmwvsusmha8/",
    "category": "Puzzle",
    "tags": "2D, Adult, Anime, Boy, Boys, Brain, Hot, Puzzle, Seduction",
    "thumb": "https://img.gamemonetize.com/16jzabb18zdx9s9otw9fikmwvsusmha8/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "63951",
    "title": "Tetris Hint",
    "description": "Tetris Hint is an engaging casual game where falling blocks challenge your strategy and quick thinking! Place the blocks into empty spaces, complete full lines to clear them, and rack up points. Build combos by clearing multiple lines in a row and aim for the highest score. Inspired by the iconic classic Tetris, this game combines timeless gameplay with vibrant graphics and captivating animations. Perfect for players of all ages, it offers a fun and exciting experience every time. Get ready to test your skills and have a blast!",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/fobiaimq9ucohvvjn5mn6kg5i1q6ekaz/",
    "category": "Puzzle",
    "tags": "2D, Casual, Fun, Hypercasual, Puzzle, Tetris",
    "thumb": "https://img.gamemonetize.com/fobiaimq9ucohvvjn5mn6kg5i1q6ekaz/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "64101",
    "title": "Skibidi Toilet Cross The Road",
    "description": "Embark on a wild adventure with Skibidi Toilet Cross the Road! The Skibidi Toilet is stranded in the middle of a mysterious forest, and it needs to get to the other side of the road. But beware! The path is full of tricky rivers, fallen logs, and wild creatures lurking in the trees. Jump over rushing streams, dodge rocks, and avoid getting caught by mischievous forest critters. Each step takes you closer to the goal, but the forest is full of surprises! Can the Skibidi Toilet conquer the wilderness and make it to the other side? The Skibidi beat never stops, so keep dancing and watch out for the next challenge!",
    "instructions": "mouse only",
    "url": "https://html5.gamemonetize.com/egw20kgvi5hwlmz43n3dwn59ob6ibrsq/",
    "category": "Adventure",
    "tags": "Skibidi Toilet",
    "thumb": "https://img.gamemonetize.com/egw20kgvi5hwlmz43n3dwn59ob6ibrsq/512x384.jpg",
    "width": "960",
    "height": "600"
  },
  {
    "id": "64136",
    "title": "Royal Rebellion Punk Magic",
    "description": "Two brave girls defy boring traditions and create their own style inspired by punk rock! Immerse yourself in the atmosphere of anarchy and freedom, where medieval epics are intertwined with daring punk rock. Dress up the girls in black leather dresses decorated with spikes and rivets, and emphasize their uniqueness with bright accents. Create hairstyles that will amaze, from bright spiky hair to braided braids framed by chains and flowers. Dont forget about makeup - bright lips, bold shadows and provocative piercings will make each of the heroines real style icons. Unleash your imagination by creating images full of energy and rebellion!",
    "instructions": "Depending on the gaming device either a click of a computer mouse or a simple touch on touch screen is used to control it ",
    "url": "https://html5.gamemonetize.com/9c7t6w1xryplb2imnw7xty8fe5pgsgl0/",
    "category": "Girls",
    "tags": "Dress Up, Hair, Makeover, Music",
    "thumb": "https://img.gamemonetize.com/9c7t6w1xryplb2imnw7xty8fe5pgsgl0/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "64141",
    "title": "Counter Craft Modern Warfare 2",
    "description": "Counter Craft Modern Warfare 2 is a first person shooter game which features big arsenal of weapons to shoot blocky creatures of Minecraft world and lots of levels to explore.",
    "instructions": "WASD - Move LMB - Shoot RMB - Aim Flashlight Space - Jump R - Reload G - Grenade C - Crouch Shift - Run Mouse Wheel - Change Weapon ",
    "url": "https://html5.gamemonetize.com/hq0cavi49cu2r3x5xlt42k8b3m0ll7xz/",
    "category": "Shooting",
    "tags": "3D, 3D Games, Action, CSGO, First Person Shooter, Gun, Minecraft, Shoot, Shoot 'Em Up, Shooter, Shooting, Unity3D",
    "thumb": "https://img.gamemonetize.com/hq0cavi49cu2r3x5xlt42k8b3m0ll7xz/512x384.jpg",
    "width": "960",
    "height": "600"
  },
  {
    "id": "64051",
    "title": "GT Formula Championship",
    "description": "GT Formula Championship is an exhilarating high-speed racing game that brings the thrill of Formula racing to life. Step into the driver&rsquo;s seat of the most powerful and technologically advanced Formula cars as you compete against elite racers on world-class tracks. With intense competition, realistic physics, and breathtaking visuals, this game delivers an adrenaline-fueled experience like no other. Realistic Formula Racing Experience GT Formula Championship is designed to immerse players in the world of professional Formula racing. Every detail, from the aerodynamics of the cars to the track surface, has been meticulously crafted to provid",
    "instructions": "arrow keys to move",
    "url": "https://html5.gamemonetize.com/t2k033u0g3n11gnyyur592liam2k86wc/",
    "category": "Racing",
    "tags": "1 Player, drifting, Driving",
    "thumb": "https://img.gamemonetize.com/t2k033u0g3n11gnyyur592liam2k86wc/512x384.jpg",
    "width": "960",
    "height": "600"
  },
  {
    "id": "64048",
    "title": "Survival Race",
    "description": "Survival Race is a high-speed battle for survival in a hexagonal arena. Each tile collapses as you drive over it, turning the race into a test of agility and strategy. Stay in the arena by making sharp turns, well-timed jumps, and calculated moves. Knock opponents off the platform into hazardous terrain like water, lava, or acid. Win golden crowns for each eliminated rival, collect coins, and pull off stunts to unlock new cars. The higher your rank, the tougher the competition&mdash;only the best can dominate the arena!",
    "instructions": "Navigate your car skillfully avoiding gaps and outmaneuvering rivals to claim victory Collect coins smash opponents and perform stunts to complete challenges and unlock better vehicles ",
    "url": "https://html5.gamemonetize.com/9km7avlf26r9se5gam8028uq4p6drmx1/",
    "category": "Adventure",
    "tags": "1 Player, Action, Arcade, Battle, Car",
    "thumb": "https://img.gamemonetize.com/9km7avlf26r9se5gam8028uq4p6drmx1/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "64001",
    "title": "Ninja Escape 2D",
    "description": "Ninja Escape is an action-packed game where you dodge obstacles and jump across endless platforms. Collect coins, avoid deadly blades, and test your reflexes as you aim for the highest score. With addictive gameplay and dynamic challenges, can you master the art of the ultimate ninja escape?",
    "instructions": "Left Arrow Right Arrow key for left and right movement",
    "url": "https://html5.gamemonetize.com/hcj7hc725wzffii48xutpvjor12awhrm/",
    "category": "Hypercasual",
    "tags": "endless, Escape, html5 games, Sport, unity, unity games, unity games for your site, unity games for your website, Unity3D, WebGL",
    "thumb": "https://img.gamemonetize.com/hcj7hc725wzffii48xutpvjor12awhrm/512x384.jpg",
    "width": "350",
    "height": "600"
  },
  {
    "id": "64053",
    "title": "Punch King 3D",
    "description": "To be a slap king! Try to have relaxed and release your press by beat your opponent. Grab the right timing and hit until your opponents fly out the arena area and knock out them.",
    "instructions": "Tap to play ",
    "url": "https://html5.gamemonetize.com/8lh0qrhh83bqcastoyjsl8z631edrkos/",
    "category": "Arcade",
    "tags": "3D",
    "thumb": "https://img.gamemonetize.com/8lh0qrhh83bqcastoyjsl8z631edrkos/512x384.jpg",
    "width": "750",
    "height": "1344"
  },
  {
    "id": "63927",
    "title": "BalloonPop",
    "description": "Balloon Pop &ndash; Fun and Addictive Clicker Game! Welcome to Balloon Pop &ndash; the simplest and most addictive balloon-popping game! Easy Gameplay: just tap the balloons to pop them! Colorful Graphics: enjoy bright and vibrant balloons! Fun Sounds: each pop is pure satisfaction! Endless Fun: play as much as you want, no limits! Compete with Friends: set high scores and become the balloon master! Ready to relax and have fun? Then Balloon Pop is just for you! Tap Play and start popping!",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/tzudq90tldjuk9x3k3wb8off7lavlf43/",
    "category": "Hypercasual",
    "tags": "1 Player, 2D, Android, Arcade, Click, Clicker",
    "thumb": "https://img.gamemonetize.com/tzudq90tldjuk9x3k3wb8off7lavlf43/512x384.jpg",
    "width": "1080",
    "height": "1920"
  },
  {
    "id": "64056",
    "title": "Sprunki: Difference and Sing",
    "description": "Sprunki: Difference and Sing is a fun and free online game designed especially for kids! Your goal is simple: find 5 differences in each level to win. Get some info about Sprunkies and what sound they make. With its playful Sprunki theme, the game offers endless enjoyment. Stuck on a tricky level? Use hints to reveal a difference and keep going. Dive in and have a blast!",
    "instructions": "Mouse to play ",
    "url": "https://html5.gamemonetize.com/xc4kmcstl0jjl7bbji4m1gh1lcmzwrgr/",
    "category": "Puzzle",
    "tags": "Brain, Difference, Fun, Hypercasual, Kids, Sprunki",
    "thumb": "https://img.gamemonetize.com/xc4kmcstl0jjl7bbji4m1gh1lcmzwrgr/512x384.jpg",
    "width": "1280",
    "height": "720"
  },
  {
    "id": "64060",
    "title": "WoodPuz: Block Puzzle Games",
    "description": "Discover WoodPuz: Block Puzzle Games &ndash; the ultimate brain-teasing escape! Are you a dedicated fan of block puzzles, always chasing that satisfying moment when every piece fits perfectly? Imagine a serene companion that&rsquo;s there to entertain you whenever you need a break. WoodPuz is a free, immersive, and addictive puzzle experience designed to keep your mind sharp and your spirit refreshed. With its innovative blend of classic block arrangements and engaging puzzle challenges, every level offers a burst of creativity and relaxation. Dive into a vibrant world where every block paves the way to endless fun and mental rejuvenation, and let your p",
    "instructions": "In BlockPuz Puzzila and Wood Cube drag wooden blocks onto the grid to form complete shapes or score points In Water Sort arrange the water bottles so that each is completely filled with water of the same color In Dice Merge align at least three dic",
    "url": "https://html5.gamemonetize.com/h3pkis8y8y3h242jfdi02umu2l7r4mq2/",
    "category": "Puzzle",
    "tags": "2D, Block, blocky, Board, Brain, Matching, Puzzle, sort, sorting, Sudoku, water",
    "thumb": "https://img.gamemonetize.com/h3pkis8y8y3h242jfdi02umu2l7r4mq2/512x384.jpg",
    "width": "720",
    "height": "1280"
  },
  {
    "id": "64079",
    "title": "Sponge Jumper",
    "description": "Sponge Jumper is a platformer where you control a sponge facing various challenges. Jump, dodge obstacles, and explore levels full of surprises as you progress through the game!",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/2uvv55bl3asl354e5cf1uq0eykhefh0x/",
    "category": "Hypercasual",
    "tags": "1 Player, Best, Fun, Funny, jump, Jumping, Kids, Mobile, Skill",
    "thumb": "https://img.gamemonetize.com/2uvv55bl3asl354e5cf1uq0eykhefh0x/512x384.jpg",
    "width": "1280",
    "height": "720"
  },
  {
    "id": "63930",
    "title": "Block Craze",
    "description": "Get ready for a thrilling puzzle adventure with Craze Block! Step into a world of vibrant colors and brain-teasing fun with Craze Block&mdash;a game that blends strategy, creativity, and endless excitement! Test your puzzle-solving skills as you arrange dazzling blocks to form perfect lines before the board fills up. Think fast, act smart! Every move counts, and only the sharpest minds will master the challenge. With its smooth mechanics and intuitive controls, Craze Block is designed for everyone&mdash;whether youre a casual player or a puzzle pro. More than just a game&mdash;it&rsquo;s a brain workout! While having fun, youll enhance your focus, sharpen y",
    "instructions": "Mouse Click amp Drag Drag blocks to place them on the board Touch Controls Mobile Tap and drag to move blocks ",
    "url": "https://html5.gamemonetize.com/0jhhen2q8nmc0n1bxwzw9ey7cilmm9nu/",
    "category": "Puzzle",
    "tags": "Block, Brain, Casual, Color, Matching, puzzleblock, Tetris",
    "thumb": "https://img.gamemonetize.com/0jhhen2q8nmc0n1bxwzw9ey7cilmm9nu/512x384.jpg",
    "width": "720",
    "height": "1280"
  },
  {
    "id": "63956",
    "title": "Get 13 Puzzle",
    "description": "Just get 13 to WIN The gameplay is simple, just get 13. Merge blocks with the same number to increase by 1 until you get 13. Already got 13?",
    "instructions": "Tap on Block to Merge blocks with the same number to increase by 1",
    "url": "https://html5.gamemonetize.com/psjtvdszfxyzn9usxmrvh5pffqe6kodm/",
    "category": "Puzzle",
    "tags": "2048, Puzzle, puzzleblock",
    "thumb": "https://img.gamemonetize.com/psjtvdszfxyzn9usxmrvh5pffqe6kodm/512x384.jpg",
    "width": "600",
    "height": "800"
  },
  {
    "id": "63952",
    "title": "Relaxing Games",
    "description": "Relax and take a Relaxing Games tour! Relaxing Games brings you a series of casual and fun mini-games, designed for you to relax in your spare time! There are various types of games, each easy to play and extremely fun, allowing you to immerse yourself easily in the game world.Simple elimination, simulation challenges, easy hooting and puzzle games, let you switch freely",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/kc2nwz5c7keuuxdu8a2142ipl74orghx/",
    "category": "Puzzle",
    "tags": "Casual, Cleaning, Hypercasual, Puzzle, Relaxation, Simulation",
    "thumb": "https://img.gamemonetize.com/kc2nwz5c7keuuxdu8a2142ipl74orghx/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "63859",
    "title": "Ice Cream Stack Runner",
    "description": "Ice Cream Stack Runner is a fun game combining parkour with everyones favorite food: ice cream.Run through a world full of obstacles while stacking the best ice cream cones. You will control ten stickmen on the parkour platform. Lead them to collect ice cream cones. Top it up with ice cream and candy.",
    "instructions": "Mouse click or tap to play ",
    "url": "https://html5.gamemonetize.com/psogl6861khooa0ywjkrfxrt3fi0v326/",
    "category": "Hypercasual",
    "tags": "Candy, Food, Ice, run",
    "thumb": "https://img.gamemonetize.com/psogl6861khooa0ywjkrfxrt3fi0v326/512x384.jpg",
    "width": "750",
    "height": "1334"
  },
  {
    "id": "63962",
    "title": "Shape Walls",
    "description": "Shape Walls is a fun and challenging puzzle game where you arrange shape pieces to reveal hidden objects. Tap to rotate the pieces and fit them into the correct outline. With increasing difficulty, each level tests your logic, observation, and spatial skills. Enjoy a relaxing yet brain-teasing experience as you complete unique puzzles. No time limits&mdash;just pure problem-solving fun!",
    "instructions": "Tap on a shape piece to rotate it Adjust the pieces to fit within the given outline Complete the shape correctly to reveal the hidden object Progress through levels with increasing complexity Enjoy the challenge and relax while solving puzzles ",
    "url": "https://html5.gamemonetize.com/q6lsd6q6espgn26s1ac2whbkw6r9yibk/",
    "category": "Puzzle",
    "tags": "1 Player, 3D",
    "thumb": "https://img.gamemonetize.com/q6lsd6q6espgn26s1ac2whbkw6r9yibk/512x384.jpg",
    "width": "350",
    "height": "600"
  },
  {
    "id": "63968",
    "title": "Stack N Sort",
    "description": "Sort, stack, and organize colorful rings in this fun &amp; addictive puzzle game! Stack N Sort &ndash; The Ultimate Sorting Puzzle Challenge! Get ready for a super satisfying and brain-teasing puzzle experience! In Stack N Sort, your goal is to sort and stack colorful rings onto the correct poles. Sounds simple? Think again! With limited space and tricky arrangements, you&rsquo;ll need sharp logic and smart moves to complete each level. How to Play: Tap &amp; drag to move rings between poles! Stack rings of the same color together Plan your moves carefully &ndash; Limited",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/oshs50wl9x5rgupqa2sp52oy87f7xprv/",
    "category": "Shooting",
    "tags": "1 Player, Puzzle, sort, sorting",
    "thumb": "https://img.gamemonetize.com/oshs50wl9x5rgupqa2sp52oy87f7xprv/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "63972",
    "title": "WhackAMole3D",
    "description": "Whack-a-Mole WebGL is a fun and fast-paced arcade game where your reflexes are put to the test! Moles randomly pop out of their holes, and it&rsquo;s your job to tap them as quickly as possible. The more moles you whack, the higher your score. As the game progresses, the speed increases, making it more challenging and exciting.",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/5q307jg2lld43bre7amoent0ir1czpa3/",
    "category": "Action",
    "tags": "1 Player, 3D, 3D Games, Action, angry, Animal, Cartoon, Crazy, Whack",
    "thumb": "https://img.gamemonetize.com/5q307jg2lld43bre7amoent0ir1czpa3/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "63953",
    "title": "Alphabet Run",
    "description": "Welcome to Alphabet Run 3D, an amazing game! You play as Alphabet A, and your mission is to collect as many alphabets as possible to defeat the blue monster. Choose the same color as your player to multiply your alphabets. Enjoy!",
    "instructions": "Tap or mouse click to play",
    "url": "https://html5.gamemonetize.com/n55awbyki5yltw2zabcywtzc5jv983xu/",
    "category": "Arcade",
    "tags": "Arcade, Hypercasual, running",
    "thumb": "https://img.gamemonetize.com/n55awbyki5yltw2zabcywtzc5jv983xu/512x384.jpg",
    "width": "720",
    "height": "1280"
  },
  {
    "id": "63986",
    "title": "Emoji Sort",
    "description": "Emoji Sort is a pattern recognition puzzle game where players must fill in empty cells with the correct emojis. Each puzzle presents a grid with missing emojis that follow specific patterns - such as categories, sequences, or associations. Players analyze the existing emojis to identify the pattern (animals, food chains, transportation types, etc.) and select the appropriate emojis to complete the grid. The game features 30 increasingly challenging levels with various pattern types, and includes a hint system to help when players get stuck. Perfect for puzzle enthusiasts who enjoy discovering logical connections between visual elements!",
    "instructions": "Mouse Click or Touch",
    "url": "https://html5.gamemonetize.com/g3gdro0n97mr5ar67bdj01z64283fh8k/",
    "category": "Puzzle",
    "tags": "1 Player, 2D, Brain, Casual",
    "thumb": "https://img.gamemonetize.com/g3gdro0n97mr5ar67bdj01z64283fh8k/512x384.jpg",
    "width": "600",
    "height": "800"
  },
  {
    "id": "61606",
    "title": "Word Connect   Crossword Puzzle",
    "description": "Word Connect - Crossword Puzzle Game is completely brain game with more fun &amp; relaxing word game in a crossword format made for brain activity and challenging word game By playing this game you will improve your spelling skills &amp; vocabulary. How to Play : Move your finger connecting letters to form a meaningful word You can form word horizontally &amp; Vertically Find as many words as possible to level completed and earn bonus rewards. Features: Get bonus coins for free hints! Fun and relaxing word search brain game! While Moving to the Next Level, You can feel more interest. 1000+ Challenging Game levels in",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/x9al1kr1h1mpaj5s6umdfgamd09okq4m/",
    "category": "Puzzle",
    "tags": "3D Games, Puzzle, unity games",
    "thumb": "https://img.gamemonetize.com/x9al1kr1h1mpaj5s6umdfgamd09okq4m/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "63857",
    "title": "Funny Pull The Beard",
    "description": "In Funny Beard Plucking, you will help a funny character pull his beard in various strange ways.But not all beard pulls are as simple as they seem. Your goal is to pull the beard. Look for the moment, look at the Angle and pull off each beard with precision. But the result is always unpredictable.",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/9755dil8btiay3oa8wa16ns8sk90g6zi/",
    "category": "Puzzle",
    "tags": "Clicker, Funny, Music, Relaxation",
    "thumb": "https://img.gamemonetize.com/9755dil8btiay3oa8wa16ns8sk90g6zi/512x384.jpg",
    "width": "720",
    "height": "1280"
  },
  {
    "id": "63879",
    "title": "Bbq Stack Run",
    "description": "Enter a running arcade adventure filled with food and fun challenges. BBQ Stack Run takes you through the craziest BBQ-collecting parkour ever. Pick up various ingredients such as beef, chicken, sausage and more on the track as you run. Sprinkle them with barbecue seasoning and cook them through.",
    "instructions": "Mouse click or tap to play ",
    "url": "https://html5.gamemonetize.com/st6twsce0w84oiet97lt3b61rd4hgzb9/",
    "category": "Arcade",
    "tags": "Cook, Food, run",
    "thumb": "https://img.gamemonetize.com/st6twsce0w84oiet97lt3b61rd4hgzb9/512x384.jpg",
    "width": "1334",
    "height": "750"
  },
  {
    "id": "63961",
    "title": "Tox Sprunki Mod",
    "description": "Tox Sprunki Mod is a platformer with unique mechanics, namely: the presence of poison, which does not allow you to stay in one place for a long time and return to where you have already been. So you have to think quickly and think through your steps in advance. The game has 24 levels.",
    "instructions": "On PC you can control the game using arrow keys or WAD keys To complete the level you need to get to the barrel ",
    "url": "https://html5.gamemonetize.com/rhxk7km8elewnyjwsu96hf01mzsfs0qe/",
    "category": "Puzzle",
    "tags": "Casual, Mobile, Platform, Puzzle",
    "thumb": "https://img.gamemonetize.com/rhxk7km8elewnyjwsu96hf01mzsfs0qe/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "63932",
    "title": "Cut And Drop Puzzle",
    "description": "Cut &amp; Drop Puzzle is an addictive physics-based puzzle game where precision and strategy are key! Use your cutting skills to slice objects, drop balls, and guide them into the right targets. This game offers a fun and engaging experience for fans of puzzle games, slicing games, and physics challenges. Whether youre looking for a relaxing casual game or a brain-teasing challenge, Cut &amp; Drop Puzzle is the perfect choice!",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/opmc3dkhqy9on79kt7seklf7b3t1i666/",
    "category": "Puzzle",
    "tags": "Casual, Hypercasual, Puzzle",
    "thumb": "https://img.gamemonetize.com/opmc3dkhqy9on79kt7seklf7b3t1i666/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "63378",
    "title": "Unpuzzle Master Tap Away ",
    "description": "Unpuzzle Master is a relaxing game of disassembling tiles in various directions, a puzzle game to hone accuracy in disassembling tiles. With various obstacles in the game, it makes it more interesting.",
    "instructions": "Touch Pad or Mouse click Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/1yx48beozcoye96896ki6hfzwj72h9x6/",
    "category": "Arcade",
    "tags": "Arcade, Puzzle, puzzleblock",
    "thumb": "https://img.gamemonetize.com/1yx48beozcoye96896ki6hfzwj72h9x6/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "62409",
    "title": "Monsterella Fantasy Makeup",
    "description": "Step into the monstrous world of beauty with Monsterella Fantasy Makeup. This spookily engaging game lets you work your makeover magic on three iconic Monster High characters - Frankie Stein, Clawdeen Wolf, and Draculaura. In Frankies unit, electrify her look with eerie eyeshadows, neon lipstick, shockingly cool hairstyles, and otherworldly outfits. Next, embrace Clawdeens earthy mystique with jewel-toned makeup and howl-inducing wardrobe choices. Finally, express Draculauras vamp chic vibe with dramatic makeup and goth-glam ensembles. Immerse yourself in monstrous glamour and let your creativity run wild in this spooktacular makeup adve",
    "instructions": "Use your mouse to play the game on a desktop tap to play on mobile devices ",
    "url": "https://html5.gamemonetize.com/yfrcm6pzpl8vq4yu3n03rjjd9jivtboa/",
    "category": "Girls",
    "tags": "1 Player, Cartoon, Fantasy, Makeover, Monster",
    "thumb": "https://img.gamemonetize.com/yfrcm6pzpl8vq4yu3n03rjjd9jivtboa/512x384.jpg",
    "width": "1024",
    "height": "768"
  },
  {
    "id": "63945",
    "title": "Kingdom Puzzles",
    "description": "Kingdom Puzzle is a relaxing brain game where you see a grid with different colored regions. Your goal is to place one king in each region while following the rules. Each region can have only one king, and kings cannot be in the same row or column. They also cannot be next to each other, meaning the nearest tiles must be empty. To win the level, you must place all kings correctly. Placing a king in the wrong spot reduces your points. If your points reach zero, you can either skip the level with a 0 score or retry after watching a short ad. Enjoy the challenge!",
    "instructions": "Use a mouse or touchpad to play this game ",
    "url": "https://html5.gamemonetize.com/3ik5v7y3fvv6m7lsdzw5iohzber7ic6l/",
    "category": "Puzzle",
    "tags": "Board, html5 games, King, Logical, Mobile, Puzzle, Skill",
    "thumb": "https://img.gamemonetize.com/3ik5v7y3fvv6m7lsdzw5iohzber7ic6l/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "63948",
    "title": "Master Candy Dash",
    "description": "Master Candy Dash is an electrifying game where your mission is to match identical blocks to earn extra time. Each time you match identical blocks, you earn a precious second, but beware: if time runs out, it&rsquo;s game over! Challenge your reflexes and matching skills in this thrilling and addictive game, where every move counts to avoid imminent defeat.",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/7q965wz5ev8n3oc5rmfufkb10fyrnaho/",
    "category": "Puzzle",
    "tags": "Best, Brain, Candy, Fun, Kids, Logic, Match 3, Match-3, Skill",
    "thumb": "https://img.gamemonetize.com/7q965wz5ev8n3oc5rmfufkb10fyrnaho/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "63862",
    "title": "Hit Knock Down 2",
    "description": "Hit &amp; Knock Down is a fun casual game where you aim to throw baseballs. Shoot as many targets as possible. Test your precision, reaction speed, and throwing skills. You aim to hit the right targets in each level. The goals at the level are very varied, such as wood, stone, etc. Each level presents different targets. You should hit with a baseball.",
    "instructions": "Mouse click or tap to play ",
    "url": "https://html5.gamemonetize.com/5aanhavelssjrc0x6xbjgd6donq7nmg9/",
    "category": "Hypercasual",
    "tags": "Baseball, Fun, Shoot",
    "thumb": "https://img.gamemonetize.com/5aanhavelssjrc0x6xbjgd6donq7nmg9/512x384.jpg",
    "width": "640",
    "height": "1136"
  },
  {
    "id": "63860",
    "title": "Baseball Star",
    "description": "Baseball Star is a fun casual sports game that lets you feel the excitement and joy of playing baseball. As a star on the field. Swing the bat and hitting the ball. Hit the ball with precision. It&rsquo;s easy to start. But the challenges will get harder.",
    "instructions": "Mouse click or tap to play ",
    "url": "https://html5.gamemonetize.com/lz24q5j25atdbwmkfy9r04cig938m8f9/",
    "category": "Sports",
    "tags": "Ball, Baseball, Skills, Sport",
    "thumb": "https://img.gamemonetize.com/lz24q5j25atdbwmkfy9r04cig938m8f9/512x384.jpg",
    "width": "720",
    "height": "1280"
  },
  {
    "id": "63922",
    "title": "Paint Tomato",
    "description": "Paint Tomato is a vibrant grid puzzle game where you match tomato colors to adjacent ones. Use strategic moves to swiftly mirror neighboring tomatoes. The urgency intensifies with a ticking bomb, pushing your quick-thinking skills. Plan carefully to transform the grid within the countdown.",
    "instructions": "Mouse Click or Touch",
    "url": "https://html5.gamemonetize.com/ahwatodb2rgcue98fgl5qddklfboypcy/",
    "category": "Puzzle",
    "tags": "1 Player, Board",
    "thumb": "https://img.gamemonetize.com/ahwatodb2rgcue98fgl5qddklfboypcy/512x384.jpg",
    "width": "600",
    "height": "800"
  },
  {
    "id": "63890",
    "title": "Jump Smash 3D",
    "description": "Jump Smash 3D &ndash; The Ultimate High-Speed Jumping Challenge! Jump Smash 3D is an exciting hyper-casual game where precision, speed, and quick reflexes are the key to victory. Designed for mobile gaming, this game delivers smooth and addictive gameplay that keeps players engaged for hours. If you love casual games, hybrid casual games, and high-energy 3D challenges, then Jump Smash 3D is the perfect game for you! Fast-Paced Jumping Action &ndash; Control a dynamic ball as it jumps, smashes obstacles, and navigates challenging levels.",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/2r0abfblnfbdacepnn2mlivnkumcj9a5/",
    "category": "Hypercasual",
    "tags": "3D, Casual, Hypercasual",
    "thumb": "https://img.gamemonetize.com/2r0abfblnfbdacepnn2mlivnkumcj9a5/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "60831",
    "title": "Dice puzzles!",
    "description": "This game is more difficult than it may seem ! You have a playing field on which you need to throw puzzles and connect the same ones!",
    "instructions": "1 At first it will be easy to connect the puzzles but over time there will be more and more of them ",
    "url": "https://html5.gamemonetize.com/tjw00q7i8vgfw87xtmzzv1j7snkmrfu8/",
    "category": "Puzzle",
    "tags": "1 Player, 2048, Ball, Brain, HTML5, Logic",
    "thumb": "https://img.gamemonetize.com/tjw00q7i8vgfw87xtmzzv1j7snkmrfu8/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "63586",
    "title": "Virus Shoot",
    "description": "Virus Shoot&ndash; Is a HTML5 and mobile run game. Virus Shoot is a great game that will help you have fun while away the time. Simple, but at the same time exciting game! Try to shoot color balls with same color virus.",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/grcsrtafdi46kgjzrcjts04dpljxe9hh/",
    "category": "Shooting",
    "tags": "2D, Color, Shooting",
    "thumb": "https://img.gamemonetize.com/grcsrtafdi46kgjzrcjts04dpljxe9hh/512x384.jpg",
    "width": "640",
    "height": "960"
  },
  {
    "id": "62110",
    "title": "Summer Rose Cone Ice Cream ",
    "description": "Its a really hot summer! Want some sweet frozen food? Eating ice cream on a hot summer day is one of the best ways to beat the heat. Vanilla, chocolate, strawberry, mint.... More than ten sweet flavors to choose from. All the flavors you can mix up all sorts of different flavors with cookies, nuts and more to make the perfect ice cream: Hundreds of combinations in all. Come on! Lets get started right now! Product Feature: - A super fun food-making game. - Make sweet yummy ice-cream. Enjoy it near the beach, on the street, in the park? You decide! Even share your ice cream to friends. - Sweet and yummy ice cream flavors",
    "instructions": "-Tons of realistic cooking tools to play oven freezer cream bag and so much more -Tons of food materials and decorations to try eggs milk salt flour cream vanilla extract butter chocolate candies and so much more - Have fun to pile ice cream a",
    "url": "https://html5.gamemonetize.com/w6jkzd9gm85gcwrvqlq07stnct7n601w/",
    "category": "Girls",
    "tags": "Cook, Cooking, Educational, Hypercasual",
    "thumb": "https://img.gamemonetize.com/w6jkzd9gm85gcwrvqlq07stnct7n601w/512x384.jpg",
    "width": "640",
    "height": "960"
  },
  {
    "id": "63001",
    "title": "2Player Tanks of War",
    "description": "Are you ready for a realistic tank battle? Now, get ready to fight in a tank battle with your friend on 8 different maps. Fight with your friend, and the one with the most hits lost will lose. In the game, you can also buy a galaxy costume if you want. Blow up your friend the most and you&rsquo;ll win the battle. The fight is really tough, so you must be very careful. Blow up your friend and victory will be yours. A two-player tank battle game.",
    "instructions": " Use the WASD and Arrow Keys to move Use the Q and P keys to fire the tank A never-ending tank battle game 8 different maps ",
    "url": "https://html5.gamemonetize.com/etvwt8f327x14otf6ftwsj3g6zjmxfp4/",
    "category": "Shooting",
    "tags": "2 Player, 2 Player Games, 2D",
    "thumb": "https://img.gamemonetize.com/etvwt8f327x14otf6ftwsj3g6zjmxfp4/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "63888",
    "title": "Apocalypse Rush",
    "description": "Apocalypse Rush is a fast-paced survival game where you must defend your trailer against endless waves of enemies! Arm yourself with various weapons, collect coins for upgrades, and try to survive as long as possible. The longer you last, the more challenging the game becomes! Are you ready for the chaos?",
    "instructions": " Controls Player 1 Move Arrow Keys Shoot K Special Attack L Player 2 Move W A S D Shoot C Special Attack V Survive the endless apocalypse and unleash powerful attacks ",
    "url": "https://html5.gamemonetize.com/yp4fk09eq150ovmu0hhii0v3s1gph4zr/",
    "category": "Action",
    "tags": "2 Player, 2 Player Games, 2D, Action, Adventure, apocalypse, Best Games, Defense, Enemies, free games for your site, free games for your website, free html5 games for your website, Fun, Games",
    "thumb": "https://img.gamemonetize.com/yp4fk09eq150ovmu0hhii0v3s1gph4zr/512x384.jpg",
    "width": "1280",
    "height": "720"
  },
  {
    "id": "63861",
    "title": "Ragdoll Break LetS Destroy",
    "description": "Come to some epic destruction in Ragdoll Break: Lets Destroy. In this fun and casual action game, you get to break, crush, and destroy ragdolls. Use all kinds of crazy weapons and tools. Such as umbrellas, cars, balls, and so on. Break ragdolls in the most satisfying way possible. Hit, crush, and smash the ragdolls into pieces.",
    "instructions": "Mouse click or tap to play ",
    "url": "https://html5.gamemonetize.com/m5wcqrk4kjo1akvu7r5kbwmxlxsxnsdx/",
    "category": "Hypercasual",
    "tags": "Car, destroy, weapons",
    "thumb": "https://img.gamemonetize.com/m5wcqrk4kjo1akvu7r5kbwmxlxsxnsdx/512x384.jpg",
    "width": "720",
    "height": "1280"
  },
  {
    "id": "63878",
    "title": "Roblox Craft Run",
    "description": "Welcome to begin a 3D running adventure full of speed and creativity in Roblox Craft Run. In this pixel-craft game, youll control your character as he runs and jumps around an exciting platform track. Jump across the bridge and walk into a new level. Start your journey through the maze. Challenge your jumping skills and strategy.",
    "instructions": "Mouse click or tap to play ",
    "url": "https://html5.gamemonetize.com/ff4tqw2853v969d00ybkce8p8fvs8ogm/",
    "category": "Racing",
    "tags": "Adventure, Craft, jump, Pixel",
    "thumb": "https://img.gamemonetize.com/ff4tqw2853v969d00ybkce8p8fvs8ogm/512x384.jpg",
    "width": "1280",
    "height": "720"
  },
  {
    "id": "62411",
    "title": "BFFs Luxury Loungewear",
    "description": "Get ready to style your way to comfort in the BFFs Luxury Loungewear game! Join the fun with Riri, Elsa, Polka, and Bonnie, each with a unique wardrobe. Choose from jersey cotton, knitted, velour, or silk sleepwear and accessories to create stylish sleepover outfits. Exercise your fashion skills and make every slumber party a plush, luxury affair. This game is perfect for budding fashionistas and dress-up game enthusiasts alike!",
    "instructions": "Use your mouse to play this game on a desktop tap to play on a mobile device ",
    "url": "https://html5.gamemonetize.com/znuuz7ynsabs1w8fduoh3up21yjh1odf/",
    "category": "Girls",
    "tags": "1 Player, Barbie, Dress Up, Fashion, Princess",
    "thumb": "https://img.gamemonetize.com/znuuz7ynsabs1w8fduoh3up21yjh1odf/512x384.jpg",
    "width": "1024",
    "height": "768"
  },
  {
    "id": "63886",
    "title": "Zombie Attack: Defense",
    "description": "Zombie Attack: Defense is an electrifying 2D game where you face hordes of hungry zombies. Armed to the teeth, fight to survive and save humanity in this apocalyptic chaos. With each wave, the challenge intensifies, demanding strategy and quick reflexes.",
    "instructions": "A D key to Walk W or Spacebar to Jump Left mouse - shoot Right mouse - bomb Z - Nuke ",
    "url": "https://html5.gamemonetize.com/vxnmnevojgzi3ncpdnxk6l480kbjqc4g/",
    "category": "Action",
    "tags": "attack, Best, Bomb, Defense, Shooting, Skill, Zombie",
    "thumb": "https://img.gamemonetize.com/vxnmnevojgzi3ncpdnxk6l480kbjqc4g/512x384.jpg",
    "width": "1280",
    "height": "720"
  },
  {
    "id": "63578",
    "title": "LOL Funny Dance",
    "description": "LOL Funny Dance is a hilarious and free-to-play online game perfect for kids. Pick your favorite celebrity, create a funny face, and watch them dance in the silliest ways possible. Enjoy endless laughter and creativity as you bring your character to life with goofy moves. Play now and have fun!",
    "instructions": "Mouse to play ",
    "url": "https://html5.gamemonetize.com/jjw0zbu7uidity0wzrfkbizzk751et0w/",
    "category": "Puzzle",
    "tags": "Arcade, Celebrity, Fun, Funny, Hypercasual, Mouse, Point And Click",
    "thumb": "https://img.gamemonetize.com/jjw0zbu7uidity0wzrfkbizzk751et0w/512x384.jpg",
    "width": "480",
    "height": "854"
  },
  {
    "id": "63902",
    "title": "Find the Set",
    "description": "The objective is simple: match three cards either with all identical attributes (back color, polygon color, and polygon shape) or all different attributes. Players must strategize to carefully observe and analyze the attributes of each card to make the right combinations.",
    "instructions": "Mouse Click or Touch",
    "url": "https://html5.gamemonetize.com/n7hoa1t36i9lx3gc6isv255w706btl1q/",
    "category": "Puzzle",
    "tags": "1 Player, 2D, Hypercasual",
    "thumb": "https://img.gamemonetize.com/n7hoa1t36i9lx3gc6isv255w706btl1q/512x384.jpg",
    "width": "600",
    "height": "800"
  },
  {
    "id": "62571",
    "title": "Drunken War",
    "description": "Welcome to &ldquo;Drunken War&rdquo; a thrilling 2D maze game that combines the challenge of navigating intricate labyrinths with the hilarious twists and turns of an inebriated hero. Get ready for a chaotic and entertaining adventure as you guide the Drunken Warrior through mind-bending mazes filled with surprises, obstacles, and, of course, a generous amount of stumbling.",
    "instructions": "Use keyboard to play",
    "url": "https://html5.gamemonetize.com/a0rpx0my0j9vya58p720mqnwarppwoco/",
    "category": "Puzzle",
    "tags": "2D, Puzzle",
    "thumb": "https://img.gamemonetize.com/a0rpx0my0j9vya58p720mqnwarppwoco/512x384.jpg",
    "width": "256",
    "height": "256"
  }
]